## Plan for api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 2 to add, 3 to change, 6 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_lambda_function.api will be updated in-place
  ~ resource "aws_lambda_function" "api" {
        id                             = "api"
        tags                           = {}
        # (24 unchanged attributes hidden)



      ~ vpc_config {
          ~ security_group_ids = [
              - "sg-03e8be52c7b5dd6cb",
              - "sg-0592826f09bf19fc7",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }
        # (2 unchanged blocks hidden)
    }

  # aws_security_group.api_lambda will be destroyed
  - resource "aws_security_group" "api_lambda" {
      - arn                    = "arn:aws:ec2:ca-central-1:507252742351:security-group/sg-0592826f09bf19fc7" -> null
      - description            = "Security group that is to be attached to the api lambda" -> null
      - egress                 = [
          - {
              - cidr_blocks      = []
              - description      = "Clickopsed"
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-03e8be52c7b5dd6cb",
                ]
              - self             = false
              - to_port          = 5432
            },
        ] -> null
      - id                     = "sg-0592826f09bf19fc7" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-03e8be52c7b5dd6cb",
                ]
              - self             = false
              - to_port          = 5432
            },
        ] -> null
      - name                   = "terraform-20210803144826255600000001" -> null
      - name_prefix            = "terraform-" -> null
      - owner_id               = "507252742351" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "api_lambda_sec_group"
        } -> null
      - tags_all               = {
          - "Name" = "api_lambda_sec_group"
        } -> null
      - vpc_id                 = "vpc-095a761b6add80a7b" -> null
    }

  # aws_security_group.rds will be destroyed
  - resource "aws_security_group" "rds" {
      - arn                    = "arn:aws:ec2:ca-central-1:507252742351:security-group/sg-03e8be52c7b5dd6cb" -> null
      - description            = "Security group that is to be attached to RDS" -> null
      - egress                 = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0592826f09bf19fc7",
                ]
              - self             = false
              - to_port          = 5432
            },
        ] -> null
      - id                     = "sg-03e8be52c7b5dd6cb" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0592826f09bf19fc7",
                ]
              - self             = false
              - to_port          = 5432
            },
        ] -> null
      - name                   = "terraform-20210730182116509700000001" -> null
      - name_prefix            = "terraform-" -> null
      - owner_id               = "507252742351" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "rds_sec_group"
        } -> null
      - tags_all               = {
          - "Name" = "rds_sec_group"
        } -> null
      - vpc_id                 = "vpc-095a761b6add80a7b" -> null
    }

  # aws_security_group_rule.api_to_rds will be destroyed
  - resource "aws_security_group_rule" "api_to_rds" {
      - cidr_blocks              = [] -> null
      - from_port                = 5432 -> null
      - id                       = "sgrule-3944135683" -> null
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-0592826f09bf19fc7" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-03e8be52c7b5dd6cb" -> null
      - to_port                  = 5432 -> null
      - type                     = "ingress" -> null
    }

  # module.rds.aws_db_proxy.proxy will be updated in-place
  ~ resource "aws_db_proxy" "proxy" {
        id                     = "scan-websites-proxy"
        name                   = "scan-websites-proxy"
        tags                   = {
            "CostCentre" = "scan-websites-production"
            "Name"       = "scan-websites-rds-proxy"
            "Terraform"  = "true"
        }
      ~ vpc_security_group_ids = [
          - "sg-03e8be52c7b5dd6cb",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.rds.aws_rds_cluster.cluster will be updated in-place
  ~ resource "aws_rds_cluster" "cluster" {
        id                                  = "scan-websites-cluster"
        tags                                = {
            "CostCentre" = "scan-websites-production"
            "Name"       = "scan-websites-cluster"
            "Terraform"  = "true"
        }
      ~ vpc_security_group_ids              = [
          - "sg-03e8be52c7b5dd6cb",
        ] -> (known after apply)
        # (36 unchanged attributes hidden)
    }

  # module.rds.aws_security_group.proxy must be replaced
+/- resource "aws_security_group" "proxy" {
      ~ arn                    = "arn:aws:ec2:ca-central-1:507252742351:security-group/sg-08393b6eea816e048" -> (known after apply)
      ~ description            = "RDS Proxy security group" -> "RDS Proxy security group used to allow communication from other resources" # forces replacement
      ~ egress                 = [
          - {
              - cidr_blocks      = []
              - description      = "Clickopsed"
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0592826f09bf19fc7",
                ]
              - self             = false
              - to_port          = 5432
            },
        ] -> (known after apply)
      ~ id                     = "sg-08393b6eea816e048" -> (known after apply)
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = true
              + to_port          = 5432
            },
          - {
              - cidr_blocks      = []
              - description      = "ingress-sg-03e8be52c7b5dd6cb"
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-03e8be52c7b5dd6cb",
                ]
              - self             = false
              - to_port          = 5432
            },
        ]
      ~ name                   = "terraform-20210731003115889000000002" -> (known after apply)
      ~ name_prefix            = "terraform-" -> (known after apply)
      ~ owner_id               = "507252742351" -> (known after apply)
        tags                   = {
            "Name" = "scan-websites_rds_proxy_sg"
        }
        # (3 unchanged attributes hidden)
    }

  # module.rds.aws_security_group.rds_proxy will be created
  + resource "aws_security_group" "rds_proxy" {
      + arn                    = (known after apply)
      + description            = "The Security group that allows communication between the proxy and the database"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = true
              + to_port          = 5432
            },
        ]
      + name                   = "scan-websites_rds_proxy_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "scan-websites-production"
          + "Name"       = "scan-websites_rds_proxy_sg"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "scan-websites-production"
          + "Name"       = "scan-websites_rds_proxy_sg"
          + "Terraform"  = "true"
        }
      + vpc_id                 = "vpc-095a761b6add80a7b"
    }

  # module.rds.aws_security_group.rds_to_proxy will be destroyed
  - resource "aws_security_group" "rds_to_proxy" {
      - arn                    = "arn:aws:ec2:ca-central-1:507252742351:security-group/sg-044ad513133d04b1a" -> null
      - description            = "Used by EFS" -> null
      - egress                 = [] -> null
      - id                     = "sg-044ad513133d04b1a" -> null
      - ingress                = [] -> null
      - name                   = "scan-websites_rds_proxy_sg" -> null
      - owner_id               = "507252742351" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "CostCentre" = "scan-websites-production"
          - "Name"       = "scan-websites_rds_proxy_sg"
          - "Terraform"  = "true"
        } -> null
      - tags_all               = {
          - "CostCentre" = "scan-websites-production"
          - "Name"       = "scan-websites_rds_proxy_sg"
          - "Terraform"  = "true"
        } -> null
      - vpc_id                 = "vpc-095a761b6add80a7b" -> null
    }

  # module.rds.aws_security_group_rule.rds["sg-03e8be52c7b5dd6cb"] will be destroyed
  - resource "aws_security_group_rule" "rds" {
      - cidr_blocks              = [] -> null
      - description              = "ingress-sg-03e8be52c7b5dd6cb" -> null
      - from_port                = 5432 -> null
      - id                       = "sgrule-564470609" -> null
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-08393b6eea816e048" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-03e8be52c7b5dd6cb" -> null
      - to_port                  = 5432 -> null
      - type                     = "ingress" -> null
    }

Plan: 2 to add, 3 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>